
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	УстановитьАктивность(ЭтотОбъект.Проведен);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
КонецПроцедуры

Процедура УстановитьАктивность(Активность)
	
	Для Каждого Строка Из ЭтотОбъект.Регистры Цикл
		НаборЗаписей = ЭтотОбъект.Движения[Строка.Имя];
		Если НаборЗаписей.Количество() = 0 Тогда
			НаборЗаписей.Прочитать();
		КонецЕсли;
		Если НаборЗаписей.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого Запись Из НаборЗаписей Цикл
			Запись.Активность = Активность;
		КонецЦикла;
		НаборЗаписей.Записать();
	КонецЦикла;
	
КонецПроцедуры




