
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ДеревоЗапросов.ИзменятьПорядокСтрок = Ложь;
	Элементы.ДеревоЗапросов.ИзменятьСоставСтрок = Ложь;
	Элементы.ДеревоЗапросов.ТолькоПросмотр = Истина;
	Элементы.ДеревоЗапросов.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	
	ДЗ = ПолучитьИзВременногоХранилища(Параметры.АдресВХ);
	ЗначениеВРеквизитФормы(ДЗ, "ДеревоЗапросов");
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗапросовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Выбрать();
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	Выбрать();
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	ЭтотОбъект.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать()
	
	ТекДанные = Элементы.ДеревоЗапросов.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Не ПустаяСтрока(ТекДанные.ИдСтроки) Тогда
		ОповеститьОВыборе(Новый Структура("ИдСтроки,Наименование", ТекДанные.ИдСтроки, ТекДанные.Наименование));
	КонецЕсли;
	
КонецПроцедуры
