
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, Форма_СтрокаНастроек());
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	ЗначениеВыбора = Новый Структура(Форма_СтрокаНастроек());
	ЗаполнитьЗначенияСвойств(ЗначениеВыбора, ЭтотОбъект);
	ОповеститьОВыборе(ЗначениеВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	ЭтотОбъект.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаФорматЧислаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Конструктор = Новый КонструкторФорматнойСтроки(ЭтотОбъект.НастройкаФорматЧисла);
	Оповещение = Новый ОписаниеОповещения("ОткрытьКонструкторФорматнойСтроки_Завершение", ЭтотОбъект, Новый Структура());
	Конструктор.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКонструкторФорматнойСтроки_Завершение(Текст, ДополнительныеПараметры) Экспорт
	
	Если Текст <> Неопределено Тогда
		ЭтотОбъект.НастройкаФорматЧисла = Текст;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция Форма_СтрокаНастроек()
	
	Возврат "НастройкаМаксКоличествоСтрок,НастройкаВыделятьОтрицательные,НастройкаМаксШиринаКолонок,НастройкаПереноситьТекст,НастройкаВыводитьВсеРегистры,НастройкаРазворачиватьГруппировки";
	
КонецФункции






