
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТабДок = ПолучитьИзВременногоХранилища(Параметры.АдресВХ);
	ЭтотОбъект.РезультатТабличныйДокумент.Вывести(ТабДок);
	
	Для Каждого Наим Из СтрРазделить("РасчетЯчеекКоличество,РасчетЯчеекСумма", ",") Цикл
		Элементы[Наим].КнопкаВыбора = Ложь;
		Элементы[Наим].ТолькоПросмотр = Истина;
		Элементы[Наим].Ширина = 10;
		Элементы[Наим].РастягиватьПоГоризонтали = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетЯчеек(Команда)
	
	Количество = 0;
	Сумма = 0;
	ВыделенныеОбласти = ЭтотОбъект.РезультатТабличныйДокумент.ВыделенныеОбласти;
	
	Для Каждого ВыделеннаяОбластьЯчеек Из ВыделенныеОбласти Цикл
		Для НомерСтроки = ВыделеннаяОбластьЯчеек.Верх По ВыделеннаяОбластьЯчеек.Низ Цикл
			Для НомерКолонки = ВыделеннаяОбластьЯчеек.Лево По ВыделеннаяОбластьЯчеек.Право Цикл
				ОбластьЯчеек = ЭтотОбъект.РезультатТабличныйДокумент.Область(НомерСтроки, НомерКолонки, НомерСтроки, НомерКолонки);
				Если ТипЗнч(ОбластьЯчеек.Расшифровка) = Тип("Число") Тогда
					Количество = Количество + 1;
					Сумма = Сумма + ОбластьЯчеек.Расшифровка;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	ЭтотОбъект.РасчетЯчеекКоличество = Количество;
	ЭтотОбъект.РасчетЯчеекСумма = Сумма;
	
КонецПроцедуры