//В связи с необходимостью обеспечить возможность функционирования обработок как внешние, некоторые объекты дублируются (с возможной адаптацией)

//Обработка.bm_Навигатор.Форма.ФормаОтчетДвиженияДокумента <- Обработка.bm_ДвиженияДокумента.Форма.Форма
//Обработка.bm_Навигатор.Форма.ФормаОтчетДвиженияДокументаНастройки <- Обработка.bm_ДвиженияДокумента.Форма.Настройки
//Обработка.bm_Навигатор.Макет.МакетОтчетДвиженияДокументаНастройки <- Обработка.bm_ДвиженияДокумента.Макет.Макет
//Обработка.bm_Навигатор.Форма.КонструкторУИД <- Обработка.bm_КонсольЗапросов.Форма.КонструкторУИД