#Область СохранениеЗапроса

Функция СохранитьЗапрос(Знач Запрос, Знач Наименование = "") Экспорт
	
	ОбъектОбработки = Обработки.bm_КонсольЗапросов.Создать();
	ОбъектОбработки.СохранитьЗапрос(Запрос, Наименование);

	Возврат Истина;
	
КонецФункции

Функция ЗапросВСтроку(Знач Запрос, Знач Наименование = "") Экспорт
	
	ОбъектОбработки = Обработки.bm_КонсольЗапросов.Создать();
	Результат = ОбъектОбработки.ЗапросВСтроку(Запрос, Наименование);
	
	Возврат Результат;
	
КонецФункции

Функция ЗапросВХ(Знач Запрос, Знач Наименование = "") Экспорт
	
	ОбъектОбработки = Обработки.bm_КонсольЗапросов.Создать();
	Результат = ОбъектОбработки.ЗапросВХ(Запрос, Наименование);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область КонсольЗапросов

Процедура ВыполнитьЗапросПакет(ПараметрыВызова, АдресРезультата) Экспорт
	
	ОбъектОбработки = Обработки.bm_КонсольЗапросов.Создать();	
	ОбъектОбработки.ВыполнитьЗапросПакет(ПараметрыВызова, АдресРезультата);
	
КонецПроцедуры

#КонецОбласти