
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект.Настройки = Параметры.Настройки;
	
	Элементы.Ссылка.РедактированиеТекста = Ложь;
	Элементы.Ссылка.КнопкаВыбора = Ложь;
	Элементы.Ссылка.КнопкаВыпадающегоСписка = Ложь;
	Элементы.Ссылка.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
	
	Элементы.RefUUID.ТолькоПросмотр = Истина;
	
	УпрФормой(ЭтотОбъект, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура RefUUIDПриИзменении(Элемент)
	
	ЕстьСсылка = ЗначениеЗаполнено(ЭтотОбъект.Ссылка) И ТипЗнч(ЭтотОбъект.Ссылка) <> Тип("Строка");
	УпрФормой(ЭтотОбъект, ЕстьСсылка);
	
КонецПроцедуры

&НаКлиенте
Процедура RefURLПриИзменении(Элемент)
	
	ВыполнитьПоиск("URL");
	
	ЕстьСсылка = ЗначениеЗаполнено(ЭтотОбъект.Ссылка) И ТипЗнч(ЭтотОбъект.Ссылка) <> Тип("Строка");
	УпрФормой(ЭтотОбъект, ЕстьСсылка);
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаОткрытие(Элемент, СтандартнаяОбработка)

	Если Не ЭтотОбъект.Настройки.НастройкаОткрыватьФормуОбработки Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ЭтотОбъект.Описание = ОписаниеОбъектаМетаданных(ЭтотОбъект.Ссылка);
	ПараметрыОткрытия = Новый Структура("Описание,Настройки,Ссылка", ЭтотОбъект.Описание, ЭтотОбъект.Настройки, ЭтотОбъект.Ссылка);
	ОткрытьФорму(ИмяФормыОбработки("ФормаОбъекта"), ПараметрыОткрытия, ЭтотОбъект.ВладелецФормы);
	
	ЭтотОбъект.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаНайти(Команда)
	
	ВыполнитьПоиск("URL");
	
	ЕстьСсылка = ЗначениеЗаполнено(ЭтотОбъект.Ссылка) И ТипЗнч(ЭтотОбъект.Ссылка) <> Тип("Строка");
	УпрФормой(ЭтотОбъект, ЕстьСсылка);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПоказатьВСписке(Команда)
	
	ЭтотОбъект.Описание = ОписаниеОбъектаМетаданных(ЭтотОбъект.Ссылка);
	ПараметрыОткрытия = Новый Структура("Описание,Настройки,Ссылка", ЭтотОбъект.Описание, ЭтотОбъект.Настройки, ЭтотОбъект.Ссылка); 
	ОткрытьФорму(ИмяФормыОбработки("ФормаСписка"), ПараметрыОткрытия,, ЭтотОбъект.Ссылка);
	
	ЭтотОбъект.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОткрытьЭлемент(Команда)
	
	Если Команда.Имя = "КомандаОткрытьФормуОбработки" Тогда
		ЭтотОбъект.Описание = ОписаниеОбъектаМетаданных(ЭтотОбъект.Ссылка);
		ПараметрыОткрытия = Новый Структура("Описание,Настройки,Ссылка", ЭтотОбъект.Описание, ЭтотОбъект.Настройки, ЭтотОбъект.Ссылка);
		ОткрытьФорму(ИмяФормыОбработки("ФормаОбъекта"), ПараметрыОткрытия, ЭтотОбъект.ВладелецФормы);
	Иначе                                      
		ПоказатьЗначение(, ЭтотОбъект.Ссылка);
	КонецЕсли;
	
	ЭтотОбъект.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПоиск(ИскатьПо)
	
	Если ИскатьПо = "UUID" Тогда		
		ВыполнитьПоискПоUUID();			
	Иначе
		ВыполнитьПоискПоURL();		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПоискПоUUID()
		
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПоискПоURL()
	
	Если Не СтрНачинаетсяС(ЭтотОбъект.RefURL, "e1cib/data") Тогда
		ЭтотОбъект.Ссылка = "Неподходящий URL";
		ЭтотОбъект.RefUUID = "";
		Возврат;
	ИначеЕсли СтрНачинаетсяС(ЭтотОбъект.RefURL, "e1cib/data/РегистрСведений") Тогда
		ЭтотОбъект.Ссылка = "Неподходящий тип";
		ЭтотОбъект.RefUUID = "";
		Возврат;
	ИначеЕсли СтрНачинаетсяС(ЭтотОбъект.RefURL, "e1cib/data/ВнешнийИсточникДанных") Тогда
		ЭтотОбъект.Ссылка = "Неподходящий тип";
		ЭтотОбъект.RefUUID = "";
		Возврат;
	КонецЕсли;
	
	Попытка
		РезультатПоиска = НайтиПоURL(ЭтотОбъект.RefURL);
	Исключение
		ЭтотОбъект.Ссылка = "Неверный URL";
		ЭтотОбъект.RefUUID = "";
		Возврат;
	КонецПопытки;
	
	ЭтотОбъект.Ссылка = РезультатПоиска.Ссылка;
	ЭтотОбъект.RefUUID = ЭтотОбъект.Ссылка.УникальныйИдентификатор();
		
КонецПроцедуры

&НаСервере
Функция НайтиПоURL(Знач ReqURL)

	Обт = РеквизитФормыВЗначение("Объект");
	Результат = Обт.НайтиПоURL(ReqURL);
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УпрФормой(Знач Форма, ЕстьСсылка)
	
	Форма.Элементы.ФормаКомандаПоказатьВСписке.Доступность = ЕстьСсылка;
	Форма.Элементы.ФормаОткрыть.Доступность = ЕстьСсылка;
	
КонецПроцедуры

&НаКлиенте
Функция ИмяФормыОбработки(Имя)
	
	ТипМетаданных = ?(СтрНачинаетсяС(ЭтотОбъект.ИмяФормы, "ВнешняяОбработка"), "ВнешняяОбработка", "Обработка");
	Возврат ТипМетаданных + ".bm_Навигатор.Форма." + Имя;
	
КонецФункции

&НаСервере
Функция ОписаниеОбъектаМетаданных(Знач Описание)
	
	Обт = РеквизитФормыВЗначение("Объект");
	Результат = Обт.ОписаниеОбъектаМетаданных(Описание);
	
	Возврат Результат;
	
КонецФункции











